# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние
# между ними в 2D пространстве.

# Пример:

# - A (3,6); B (2,1) -> 5,09
# - A (7,-5); B (1,-1) -> 7,21
while True:
    A = input("Введите через запятую координаты точки А: ")
    B = input("Введите через запятую координаты точки B: ")
    if A == "" or B == "":
        break
    else:
        A = A.split(",")
        B = B.split(",")
        AB = ((int(B[0])-int(A[0]))**2+(int(B[1])-int(A[1]))**2)**(0.5)
        AB = str(AB).split('.')
        print(f"A ({A[0]},{A[1]}); B ({B[0]},{B[1]}) -> {AB[0]},{AB[1][0:2]}")
